/*******************************************************************************
*  Copyright (C) 2010 - All Rights Reserved
*		
* хМ╪ЧвВуъ:	фО╥и╪рвЕ
* ╟Фх╗кЫсп: фО╥и╣Гвс	
* ╢╢╫╗хуфз:	2012дЙ8тб18ху 
* хМ╪ЧюЗй╥:	2012дЙ8тб18хуйв╟Ф
* Version:  1.0 
* Demo лт╠╕╣ьж╥ё╨http://store.taobao.com/shop/view_shop.htm?asker=wangwang&shop_nick=qifeidianzi
**********************************************************************************************************************************************
юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюа
юаюаюаюаюаюаюаюаюаюаюар╩юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаю╖р╩юаюаюаюаюаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюа
юаюаю╖р╩р╩р╩р╩юар╩р╩р╩р╩р╩р╩╤Чюаюаюаюаю╖р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюаюакд┘√юаюар╩р╩юаюаюар╩юаюаюаюаюаюаюаюаюар╩р╩р╩р╩кдкдр╩р╩р╩юаюаюаюаюаюа
юаюаюаюаюаюар╩юаюаюар╩╤Чр╩юаюаюаюаюаюар╩р╩р╩р╩кд┘√╤Чр╩кдюар╩р╩юаюаюаюаюакдр╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюакдюаюакдр╩р╩р╩р╩┘√юаюаюаюаюаюа
юаюаюакд┘√┘√р╩юаюа┘√юаюаюакдюаюаюаюаюаюаюаюаюаюаюаю╖р╩юар╩р╩юаюаюаюаюаюаюар╩р╩┘√┘√р╩р╩┘√┘√┘√р╩р╩юаюаюаюаюаюа┘√┘√┘√┘√┘√┘√р╩р╩┘√┘√┘√юаюаюаюаюаюа
юаюаюар╩юа╤Чр╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюа╤Чр╩р╩ю╖юаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩кдюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюа
юаюаюар╩р╩р╩р╩р╩┘√╤Чр╩р╩┘√р╩юа┘√юаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩юаюаюаюаюаюаюар╩р╩юаюар╩р╩юаюаюар╩ю╖юаюаюаюаюар╩р╩кдюаюаюаюар╩р╩юаюаю╖р╩р╩кдюаюаюа
юаюаюаюаюаюаюар╩ю╖р╩юар╩┘√р╩юаюаюаюаюаюаюаюаюаюаюаю╖р╩юаюар╩р╩юаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩┘√юаюаюаюаюаюаюаюаюаюаюаюар╩р╩┘√юаюаюаюаюаюаюаюа
юа╤Чр╩р╩р╩юакдю╖┘√р╩р╩р╩┘√р╩юаюаюаюаюаюаюаюаюаюаюаюар╩р╩юаюаюаюаюаюаюаюаюаюаюаюаюакдр╩┘√юаюаюаюаюаюар╩юаюаюаюаюаюаюаюаюар╩р╩┘√юаюаюаюаюаюаюаюа
юаюаюаюаюаюар╩юаюаюаюаюар╩р╩юаюаюаюаюаюаюаюаюаюаюаюа┘√р╩р╩р╩р╩р╩р╩ю╖юаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаю╖юаюа┘√р╩р╩юаюаюаюаюаюаюаюаюа
юаюаюаюар╩р╩р╩юаюаю╖р╩р╩р╩р╩юаюаюаюаюаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩юаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюар╩р╩р╩р╩кдюаюаюаюаюаюаюаюаюа
юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюа
**********************************************************************************************************************************************/

#ifndef OV7670_H
#define OV7670_H

#define OV7670_DEVICE_WRITE_ADDRESS    0x42
#define OV7670_DEVICE_READ_ADDRESS     0x43

#define Cmos_VSYNC PCout(4)
#define Cmos_CS   PAout(0)
#define WriteControl PCout(13)

/*OV7670FIFOдё©И©ьжфрЩ╫е╤╗рЕ*/
#define FIFO_WR    PCout(10) 
#define FIFO_WRST  PAout(13)
#define FIFO_RCK   PAout(2)
#define FIFO_RRST  PAout(15)
#define FIFO_OE	   PAout(14)

void set_Cmos7670reg(void);	
unsigned char Cmos7670_init(void);
unsigned char WrCmos7670(unsigned char regID, unsigned char regDat);
unsigned char rdCmos7670Reg(unsigned char regID);
void Cmos7670_Size(unsigned int Startx,unsigned int Starty,unsigned int width,unsigned int height);

#endif

