/*******************************************************************************
*  Copyright (C) 2010 - All Rights Reserved		
* хМ╪ЧвВуъ:	фО╥и╪рвЕ
* ╟Фх╗кЫсп: фО╥и╣Гвс	
* ╢╢╫╗хуфз:	2010дЙ6тб10ху 
* хМ╪ЧюЗй╥:	2011дЙ2тб10хупч╦д
            2012дЙ9тб20хутыпч╦д
* Version:  3.5 
* Demo лт╠╕╣ьж╥ё╨http://qifeidz.taobao.com/
**********************************************************************************************************************************************
юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюа
юаюаюаюаюаюаюаюаюаюаюар╩юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаю╖р╩юаюаюаюаюаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюа
юаюаю╖р╩р╩р╩р╩юар╩р╩р╩р╩р╩р╩╤Чюаюаюаюаю╖р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюаюакд┘√юаюар╩р╩юаюаюар╩юаюаюаюаюаюаюаюаюар╩р╩р╩р╩кдкдр╩р╩р╩юаюаюаюаюаюа
юаюаюаюаюаюар╩юаюаюар╩╤Чр╩юаюаюаюаюаюар╩р╩р╩р╩кд┘√╤Чр╩кдюар╩р╩юаюаюаюаюакдр╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюакдюаюакдр╩р╩р╩р╩┘√юаюаюаюаюаюа
юаюаюакд┘√┘√р╩юаюа┘√юаюаюакдюаюаюаюаюаюаюаюаюаюаюаю╖р╩юар╩р╩юаюаюаюаюаюаюар╩р╩┘√┘√р╩р╩┘√┘√┘√р╩р╩юаюаюаюаюаюа┘√┘√┘√┘√┘√┘√р╩р╩┘√┘√┘√юаюаюаюаюаюа
юаюаюар╩юа╤Чр╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюа╤Чр╩р╩ю╖юаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩кдюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюа
юаюаюар╩р╩р╩р╩р╩┘√╤Чр╩р╩┘√р╩юа┘√юаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩юаюаюаюаюаюаюар╩р╩юаюар╩р╩юаюаюар╩ю╖юаюаюаюаюар╩р╩кдюаюаюаюар╩р╩юаюаю╖р╩р╩кдюаюаюа
юаюаюаюаюаюаюар╩ю╖р╩юар╩┘√р╩юаюаюаюаюаюаюаюаюаюаюаю╖р╩юаюар╩р╩юаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩┘√юаюаюаюаюаюаюаюаюаюаюаюар╩р╩┘√юаюаюаюаюаюаюаюа
юа╤Чр╩р╩р╩юакдю╖┘√р╩р╩р╩┘√р╩юаюаюаюаюаюаюаюаюаюаюаюар╩р╩юаюаюаюаюаюаюаюаюаюаюаюаюакдр╩┘√юаюаюаюаюаюар╩юаюаюаюаюаюаюаюаюар╩р╩┘√юаюаюаюаюаюаюаюа
юаюаюаюаюаюар╩юаюаюаюаюар╩р╩юаюаюаюаюаюаюаюаюаюаюаюа┘√р╩р╩р╩р╩р╩р╩ю╖юаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаю╖юаюа┘√р╩р╩юаюаюаюаюаюаюаюаюа
юаюаюаюар╩р╩р╩юаюаю╖р╩р╩р╩р╩юаюаюаюаюаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩юаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюар╩р╩р╩р╩кдюаюаюаюаюаюаюаюаюа
юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюа
**********************************************************************************************************************************************/


#ifndef TFT_H
#define TFT_H

///////////////////////////////////////////////////////
//TFT colors
#define	BLACK	0x0000
#define	BLUE	0x001F
#define	RED 	0xF800
#define	GREEN 	0x07E0
#define CYAN	0x07FF
#define MAGENTA 0xF81F
#define YELLOW	0xFFE0
#define WHITE	0xFFFF		

#define AM         011



//-----------------------------------------------------------------------------
// Function Prototypes
//-----------------------------------------------------------------------------
void Tft_WR_DATA16(unsigned int inputdata);
void TftWrite16(unsigned int index);
void TftWrite(unsigned int index,unsigned int inputdata);
void Tft_Init(void);
void TftClear(unsigned int Color);
void TftWR_Str(unsigned int x,unsigned int y,unsigned char *s,unsigned int color,unsigned int xcolor);
void TftWR_SingleStr(unsigned char inputdata,unsigned int color,unsigned int xcolor);
void Tft_SetBackground(unsigned int StartX,unsigned int StartY,unsigned int LongX,unsigned int LongY);
void Tft_SetCursor(unsigned int Xpos, unsigned int Ypos);
//-----------------------------------------------------------------------------
#endif                             

