/*******************************************************************************
*  Copyright (C) 2010 - All Rights Reserved		
* хМ╪ЧвВуъ:	фО╥и╪рвЕ
* ╟Фх╗кЫсп: фО╥и╣Гвс	
* ╢╢╫╗хуфз:	2010дЙ6тб10ху 
* хМ╪ЧюЗй╥:	2011дЙ2тб10хупч╦д
            2012дЙ9тб20хутыпч╦д
* Version:  3.5 
* Demo лт╠╕╣ьж╥ё╨http://qifeidz.taobao.com/
**********************************************************************************************************************************************
юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюа
юаюаюаюаюаюаюаюаюаюаюар╩юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаю╖р╩юаюаюаюаюаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюа
юаюаю╖р╩р╩р╩р╩юар╩р╩р╩р╩р╩р╩╤Чюаюаюаюаю╖р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюаюакд┘√юаюар╩р╩юаюаюар╩юаюаюаюаюаюаюаюаюар╩р╩р╩р╩кдкдр╩р╩р╩юаюаюаюаюаюа
юаюаюаюаюаюар╩юаюаюар╩╤Чр╩юаюаюаюаюаюар╩р╩р╩р╩кд┘√╤Чр╩кдюар╩р╩юаюаюаюаюакдр╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюакдюаюакдр╩р╩р╩р╩┘√юаюаюаюаюаюа
юаюаюакд┘√┘√р╩юаюа┘√юаюаюакдюаюаюаюаюаюаюаюаюаюаюаю╖р╩юар╩р╩юаюаюаюаюаюаюар╩р╩┘√┘√р╩р╩┘√┘√┘√р╩р╩юаюаюаюаюаюа┘√┘√┘√┘√┘√┘√р╩р╩┘√┘√┘√юаюаюаюаюаюа
юаюаюар╩юа╤Чр╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюаюа╤Чр╩р╩ю╖юаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩кдюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюа
юаюаюар╩р╩р╩р╩р╩┘√╤Чр╩р╩┘√р╩юа┘√юаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩юаюаюаюаюаюаюар╩р╩юаюар╩р╩юаюаюар╩ю╖юаюаюаюаюар╩р╩кдюаюаюаюар╩р╩юаюаю╖р╩р╩кдюаюаюа
юаюаюаюаюаюаюар╩ю╖р╩юар╩┘√р╩юаюаюаюаюаюаюаюаюаюаюаю╖р╩юаюар╩р╩юаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩р╩┘√юаюаюаюаюаюаюаюаюаюаюаюар╩р╩┘√юаюаюаюаюаюаюаюа
юа╤Чр╩р╩р╩юакдю╖┘√р╩р╩р╩┘√р╩юаюаюаюаюаюаюаюаюаюаюаюар╩р╩юаюаюаюаюаюаюаюаюаюаюаюаюакдр╩┘√юаюаюаюаюаюар╩юаюаюаюаюаюаюаюаюар╩р╩┘√юаюаюаюаюаюаюаюа
юаюаюаюаюаюар╩юаюаюаюаюар╩р╩юаюаюаюаюаюаюаюаюаюаюаюа┘√р╩р╩р╩р╩р╩р╩ю╖юаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаю╖юаюа┘√р╩р╩юаюаюаюаюаюаюаюаюа
юаюаюаюар╩р╩р╩юаюаю╖р╩р╩р╩р╩юаюаюаюаюаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩юаюаюаюаюаюаюаюаюаюар╩р╩р╩р╩р╩р╩р╩юаюаюаюаюаюаюар╩р╩р╩р╩кдюаюаюаюаюаюаюаюаюа
юаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюаюа
**********************************************************************************************************************************************/
#include<C8051F340.h>
#include<delay.h>

#define SDA_IN0()		{P0MDOUT= 0X00;}
#define SDA_OUT0()		{P0MDOUT= 0XFF;}


sbit I2C_SCL0=P0^2;
sbit I2C_SDA0=P0^1;
sbit SDA_STATE0=P0^1;


void InitI2C0(void)
{
	P0MDIN |= 0X06;
	P0MDOUT|= 0X06;
}

void StartI2C0(void)
{
	I2C_SDA0=1;    
    delay_us(100);

    I2C_SCL0=1;	   
    delay_us(100);
 
    I2C_SDA0=0;
    delay_us(100);

    I2C_SCL0=0;	 
    delay_us(100);


}

void StopI2C0(void)
{
	I2C_SDA0=0;
    delay_us(100);
 
    I2C_SCL0=1;
    delay_us(100);  

    I2C_SDA0=1;
    delay_us(100);
 

}


void NoAck0(void)
{
	
	I2C_SDA0=1;
	delay_us(100);
	
	I2C_SCL0=1;
	delay_us(100);
	
	I2C_SCL0=0;
	delay_us(100);
	
	I2C_SDA0=0;
	delay_us(100);

}


unsigned char I2CWrite0(unsigned char DData)
{
	unsigned char j,tem;

	for(j=0;j<8;j++) 
	{
		if((DData<<j)&0x80)
		{
			I2C_SDA0=1;
		}
		else
		{
			I2C_SDA0=0;
		}
		delay_us(100);
		I2C_SCL0=1;
		delay_us(100);
		I2C_SCL0=0;;
		delay_us(100);

	}
	delay_us(100);
	
	SDA_IN0();
	delay_us(100);
	I2C_SCL0=1;
	delay_us(1000);
	if(SDA_STATE0==1)
	{
		tem=0;  
	}
	else
	{
		tem=1;   
	}
	I2C_SCL0=0;
	delay_us(100);	
    SDA_OUT0();

	return(tem);  
}
